# my_dict = {
#     'Пушкин' : ['Руслан и Людмила', 'Капитанская дочка'],
#     'Лермонтов' : 'Бородино'
# }

my_dict = {
    'Пушкин': ['Руслан и Людмила', 'Капитанская дочка'],
    'Лермонтов': 'Бородино',
    'Историки': {
        'Карамзин': 'История России',
        'Уткин': ['Вторая Мировая', 'Третья Мировая']
    }
}
# удалить пару ключ-значение по ключу:
# del my_dict['Пушкин']
print(my_dict['Пушкин'][0])
print(my_dict['Историки']['Уткин'][1])

user = {
    (123, 242): 'dima123',
    'password': 'qwerty',
    'telephone': 88005553535,
    'cod_word': 'тузик'
}

print(user)

