# Цикл for применим в двух случаях
# 1 - когда мы заранее знаем сколько раз сработает тело цикла

start = 2  # необязателен, по умолчанию равен 0
stop = 15
step = 3  # необязателен, по умолчанию равен 1

for i in range(start, stop, step):
    print(i)

# 2 - когда нужно перебрать последовательность (например строку)
string = 'Я гулял на море, мимо проплывали корабли, солнце садилось'

count_a = 0
for symbol in string:
    if symbol == 'а':
        count_a += 1
print('Букв а в строке:', count_a)

for i in range(10):
    print(i, end=', ')
# параметр end ОТМЕНЯЕТ ПЕРЕНОС СТРОКИ и ДОБАВЛЯЕТ СИМВОЛ
# после каждого элемента