"""

Это логические операторы, сравнивающие значения и возвращающие True/False (сами значения не меняют:

> >= < <= == != in not

А это операторы сравнения, которые МЕНЯЮТ значение переменной:

= += -= *= /= //= %= **=

"""

# Операторы присваивания:

a = 10

a += 5

print(a)


b = 100
b /= 3

print(b)

b = 100
b %= 3

print(b)


c = 10
c -= 3

print(c)

# Операторы сравнения:

a = 5
b = 2
print(a > b)

a = 3
b = 3
print(a == b)

text = 'hello'
print('h' in text)

text = 'hello'
print('g' not in text)
