"""Кортеж в Python это: последовательность элементов, которые разделены между собой запятой
и заключены в скобки. Неизменяемый упорядоченный тип данных. Грубо говоря, кортеж - это список,
 который нельзя изменить. """
cortege = (1, 5, 29, 2, 3, 10, 2, 10, 10)
cortege[3]  # срезы работают так же - выведется 2
'''ВСЕ методы для работы с кортежем (их всего два)'''
print(cortege.index(29))  # индекс элемента
print(cortege.count(10))  # количество одинаковых элементов

print(type(cortege))  # <class 'tuple'>
tup = tuple()  # создание пустого кортежа
tup = ()  # создание пустого кортежа
